# bookroom_data.py

DISTRICTS = {
    "西工区": [  # 13个
        {
            "name": "上阳宫城市书房",
            "address": "滨河北路洛浦公园内上阳宫文化园大门东侧",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "体育场路城市书房",
            "address": "体育场路与九都路交叉口东北角",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "工人俱乐部城市书房",
            "address": "王城大道工人俱乐部院内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "王城公园城市书房",
            "address": "王城公园西门内",
            "info": "开放时间：8:00-20:00"
        },
        {
            "name": "和昌城市书房",
            "address": "汉宫路和昌中央城邦营销中心",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "玻璃厂南路城市书房",
            "address": "玻璃厂南路市39中学校门口",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "解放北路城市书房",
            "address": "解放北路与纱厂东路交叉口东北角",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "王府井城市书房",
            "address": "纱厂南路与中州中路交叉口东南角王府井百货4楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "国花路城市书房",
            "address": "国花路鑫豪小区东门内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "建福路城市书房",
            "address": "纱厂西路与建福路交叉口小游园内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "洛浦苑城市书房",
            "address": "洛浦公园电视塔斜对面",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "万达广场城市书房",
            "address": "珠江路与辽宁路交叉口向北50米路东",
            "info": "开放时间：9:30-21:30"
        },
        {
            "name": "科技馆城市书房",
            "address": "南昌路洛阳市科技馆一楼北侧",
            "info": "开放时间：8:30-20:30"
        }
    ],
    "涧西区": [  # 15个
        {
            "name": "银川路城市书房",
            "address": "银川路和顺园5号楼门面房56中斜对面",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "永邦城市书房",
            "address": "中州西路与拥军路交叉口",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "大学科技园城市书房",
            "address": "龙裕路与科技东路交叉口大学科技园二期毕昇园10号楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "王府井城市书房",
            "address": "南昌路王府井6楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "东方红城市书房",
            "address": "建设路与长安路交叉口长安茶城院内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "洛浦公园城市书房",
            "address": "滨河北路与珠江路交叉口洛浦公园内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "联盟路城市书房",
            "address": "联盟路与太原路交叉口西北角洛阳市二中门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "太原路城市书房",
            "address": "太原路东升二中南院门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "陇北二路城市书房",
            "address": "景华路与陇北二路交叉口五中门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "芳华路城市书房",
            "address": "芳华路三十二中东侧门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "青年宫城市书房",
            "address": "中州东路与北大街交叉口向东300米路北圣玺珠宝二楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "西苑公园城市书房",
            "address": "南昌路与九都路交叉口西苑公园内西北角",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "汉宫西路城市书房",
            "address": "汉宫路555号(安德莉亚食品公司门口)",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "建业广场城市书房",
            "address": "中州中路建业凯旋广场5楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "牡丹广场城市书房",
            "address": "天津路与湖北路交叉口云峰国际5号门面房",
            "info": "开放时间：8:30-20:30"
        }
    ],
    "老城区": [  # 11个
        {
            "name": "文峰塔城市书房",
            "address": "九都路与柳林街交叉口北100米洛邑古城4号楼4-1",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "九龙鼎城市书房",
            "address": "中州东路六中南校区西侧",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "鼓楼城市书房",
            "address": "东大街153号",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "丽景城市书房",
            "address": "老城区金谷北路丽景社区门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "状元府邸城市书房",
            "address": "状元红路2号状元府邸小区门口",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "大唐东市城市书房",
            "address": "王城大道路西靠近市车管所一分所",
            "info": "开放时间：8:30-20:00"
        },
        {
            "name": "魏紫路城市书房",
            "address": "魏紫路与二乔路交叉口西200米路南",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "洛神公园城市书房",
            "address": "滨河北路与饮马街交叉口",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "洛八办城市书房",
            "address": "九都东路洛八办门面房",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "古城天街城市书房",
            "address": "古城天街步行街B区001号",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "长春路城市书房",
            "address": "长春路10号",
            "info": "开放时间：8:30-20:30"
        }
    ],
    "瀍河区": [  # 8个
        {
            "name": "大北门城市书房",
            "address": "环城北路大北门文化产业园内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "朱樱塔城市书房",
            "address": "洛浦公园朱樱塔段",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "南洋阅享城市书房",
            "address": "民族路民族桥东南角",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "恒大社区城市书房",
            "address": "中州东路恒大绿洲社区东区",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "杨文办事处城市书房",
            "address": "巨龙家园五三七广场北侧",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "华新社区城市书房",
            "address": "九都东路华新社区负一楼",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "龙源花园城市书房",
            "address": "北盟路龙源花园内",
            "info": "开放时间：8:30-20:30"
        },
        {
            "name": "熙春花园城市书房",
            "address": "中州东路与启明南路交叉口东侧核桃园广场",
            "info": "开放时间：8:30-20:30"
        }
    ]
}